package kz.axelrod.finalproject.utils;

public enum PhysicalConstants {

    T1(277.15D),        // Температура газа на входе в нагнетатель: K
    T2(294.15D),        // Температура газа на входе в нагнетатель: K
    volumeFlowUnderOperatingConditions(388000D),         // Объемный расход при рабочих условиях: м^3/час
    inletGasTemperature(4D),              // Температура газа на входе: С
    actualSpeed(4900D), // Фактическая частота вращения: об/мин
    kn(1D),             // Количество нагнетателей в цехе, 5 шт.
    kng(1D),            // Количество рабочих групп нагнетателей в КС, 2 шт.
    gasPressureAtTheCompressorInlet(30.5D),      // Давление газа на входе при работе одного компрессора: кг/см^2
    Pvyhodk(36.8D),     // Давление газа на выходе из компрессора: кг/см^2
    rsy(0.7318D),       // Плотность газа при стандартных условиях (20 С и 760 мм.рт.ст. (пикнометрическая)):   кг/м^3
    externalAirPressure(738D),           // Давление наружного воздуха, мм.рт.ст.
    outdoorTemperature(4D),             // Температура наружного воздуха, С


    // ===================
    // Константы
    Rc(8.3144626D),     // Универсальная газовая постоянная идеального газа: Дж/(моль*К)
    Rvoz(286.8D),       // Газовая постоянная воздуха: Дж/(кг*К)
    Rvoz1(29.27D),      // Газовая постоянная воздуха: кгс м/(кг*К)
    Rg(8314.51D),       // Универсальная газовая постоянная: Дж/(кмоль*C)
    g(9.80665D),        // Ускорение силы тяжести: м/сек^2
    M0(0.029D),         // Молярная масса воздуха, кг/моль


    // ===================
    // Состав газа - объемная доля
    x_CH4(91.828D / 100),   // Метан СН4
    x_C2H6(3.049D / 100),   // Этан C2H6
    x_C3H8(0.68D / 100),    // Пропан C3H8
    x_iC4H10(0.076D / 100), // Изо-бутан i-C4H10
    x_nC4H10(0.130D / 100), // Норм-бутан n-C4H10
    x_C5H12(0.036D / 100),  // Изо-пентан C5H12
    x_C5H121(0.031D / 100), // Норм-пентан C5H12
    x_C6H14(0.06D / 100),   // Гексаны C6H14
    x_N2(3.884D / 100),     // Азот N2
    x_CO2(0.211D / 100),    // Диоксид углерода CO2
    x_O2(0.014D / 100),     // Кислород O2


    // ===================
    // Состав газа - Молекулярная масса (кг/кмоль)
    M_CH4(16.043D), M_C2H6(30.070D), M_C3H8(44.097D), M_iC4H10(58.123D), M_nC4H10(58.123D),
    M_C5H12(72.150D), M_C5H121(72.150D), M_C6H14(86.177D), M_N2(28.135D), M_CO2(44.010D), M_O2(31.9988D),


    // ===================
    // Состав газа - Критическая температура (К)
    T_CH4(190.555D), T_C2H6(305.83D), T_C3H8(369.82D), T_iC4H10(408.13D), T_nC4H10(425.14D),
    T_C5H12(460.39D), T_C5H121(469.59D), T_C6H14(506.4D), T_N2(126.2D), T_CO2(304.2D), T_O2(154.58D),


    // ===================
    // Состав газа - Критическое давление (МПа)
    P_CH4(4.5988D), P_C2H6(4.88D), P_C3H8(4.25D), P_iC4H10(3.648D),
    P_nC4H10(3.784D), P_C5H12(3.381D), P_C5H121(3.364D), P_C6H14(3.03D),
    P_N2(3.39D), P_CO2(7.386D), P_O2(5.043D),


    // ===================
    // Состав газа - Фактор сжимаемости
    z_CH4(0.9981D), z_C2H6(0.992D), z_C3H8(0.9834D), z_iC4H10(0.971D), z_nC4H10(0.9682D),
    z_C5H12(0.953D), z_C5H121(0.945D), z_C6H14(0.919D), z_N2(0.9997D), z_CO2(0.9947D), z_O2(0.9993D),


    // ===================
    // Состав газа - Плотность газа (кг/м^3)
    r_CH4(0.66692D), r_C2H6(1.25004D), r_C3H8(1.83315D), r_iC4H10(2.41623D), r_nC4H10(2.41623D),
    r_C5H12(2.99934D), r_C5H121(2.99934D), r_C6H14(3.58246D), r_N2(1.16455D), r_CO2(1.82954D), r_O2(1.33022D),


    // =================================================
    // =================================================
    // =================================================
    // Техническая характеристика Турбины ГТ-700-5
    Nnom(4250.0D),      // номинальная мощность ГТУ:кВт
    ettan(25.0D),       // КПД: %
    ntvd(5000.0D),      // частота вращения турбокомпрессора (ТВД): об/мин
    ntnd(5500.0D),      // частота вращения силового вала (ТНД): об/мин


    // =================================================
    // =================================================
    // =================================================
    // Техническая характеристика Компрессора ГТ-700-5 (модель ЦБН 280-12-4 (280-11-1(2))
    Qkom(13000000.0D),  // Коммерческий расход при стандартных условиях: млн.*м^3/сут
    ettank(84.0D),      // КПД: %
    nn(7950.0D),        // Номинальная частота вращения: об/мин
    Pvhod(45.0D),       // Давление газа на входе при работе одного компрессора: кг/см^2
    Pvyhod(56.0D),      // Давление газа на выходе из компрессора: кг/см^2
    ePmin(1.0D),        // Степень сжатия, min
    ePmax(1.27D),       // Степень сжатия, max
    qprmin(130D),       // минимальное значение объемного приведенного расхода, м^3/мин
    qprmax(300D),       // максимальное значение объемного приведенного расхода, м^3/мин

    // =================================================
    // =================================================
    // =================================================

    inletGasTemperatureKelvin(0D),
    Pd(0D),
    Tn(0D),             // Термодинамическая температура газа на входе: К
    Rpr(0D),            // Универсальная газовая постоянная практический:   кГм/(кг*К)
    pl(0D),
    GAS_CONSTANT_OF_COMPRESSED_GAS(0D),
    PERFORMANCE_OF_ONE_BLOWER(0D),
    CLUTCH_POWER_CONSUMED_BY_SUPERCHARGER(0D),
    GAS_DENSITY_UNDER_NORMAL_CONDITIONS(0D),
    gasDensityAtStandardConditions(0D),
    VOLUMETRIC_PERFORMANCE_OF_THE_SUPERCHARGER(0D),
    NOMINAL_COMPRESSION_RATIO(0D),
    INLET_GAS_PRESSURE_AT_THE_COMPRESSOR(0D),
    Pk(0D),             // Конечное давление на участке газопровода: кг/см^2
    LOSS_OF_PRESSURE_IN_DUST_COLLECTORS_AND_SUCTION_CIRCUIT(0D),
    relativeTurns(0D),
    VOLUMETRIC_REDUCED_FLOW(0D),
    GAS_DENSITY_AT_THE_BLOWER_INLET_AT_SUCTION(0D),
    MOLECULAR_WEIGHT_OF_GAS(0D),
    REDUCED_RELATIVE_INTERNAL_POWER(0D),
    epr(0D),
    REDUCED_ROTOR_SPEED(0D),
    CRITICAL_GAS_TEMPERATURE(0D),
    CRITICAL_GAS_PRESSURE(0D),
    REDUCED_GAS_TEMPERATURE(0D),
    REDUCED_GAS_PRESSURE(0D),
    GAS_COMPRESSIBILITY_FACTOR(0D),
    INTERNAL_BLOWER_POWER(0D),
    an(0D), bn(0D), cn(0D),
    dn(0D), ae(0D), be(0D), ce(0D), de(0D),

    akpd(0D), bkpd(0D), ckpd(0D), dkpd(0D), ekpd(0D),
    POLYTROPIC_EFFICIENCY(0D),
    m1(0D),
    POLYTROPIC_INDEX(0D),
    GAS_ADIABATIC_INDEX_KOBZ_FORMULA(0D),
    e11(0D), e2(0D), e3(0D), e4(0D),
    TEMPERATURE_DIFFERENCE(0D)
    ;

    // =================================================
    // =================================================
    // =================================================


    private Double value;

    PhysicalConstants(Double value) {
        this.value = value;
    }

    public Double getValue() {
        return value;
    }

    public void setValue(Double value) {
        this.value = value;
    }
}
